---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BackgroundPatternColorParam
source: html/f50e77b1-a016-3ec1-c07d-00e41d8960b2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BackgroundPatternColorParam Property

"Background Pattern Color"

## Syntax (C#)
```csharp
public static ForgeTypeId BackgroundPatternColorParam { get; }
```